INSERT INTO public."代替商品" ("商品コード", "代替商品コード", "優先順位", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('10101001', 'P0000001', 1, '2023-04-24 23:56:06.001000', 'admin', '2023-04-24 23:56:06.001000', 'admin');

INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('002', '001', 2, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');
INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('001', 'X01', 2, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');
INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('001', 'X02', 1, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');
INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('001', 'Z01', 1, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');

INSERT INTO public."顧客別販売単価" ("商品コード", "取引先コード", "販売単価", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('10101001', '001', 800, '2022-04-19 15:00:00.000000', 'admin', '2022-04-19 15:00:00.000000', 'admin');
