INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10101001', '牛ひれ', '牛ひれ', '牛ひれ', '1', '1234567890', 1000, 900, 500, 1, '00101001', 1, 1, 1, '001', 0,
        '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10101002', '牛ロース', '牛ロース', '牛ロース', '1', '1234567890', 1000, 900, 500, 1, '00101001', 1, 1, 1,
        '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10102001', '豚ひれ', '豚ひれ', '豚ひれ', '1', '1234567890', 1000, 900, 500, 1, '00101002', 1, 1, 1, '001', 0,
        '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10102002', '豚ロース', '豚ロース', '豚ロース', '1', '1234567890', 1000, 900, 500, 1, '00101002', 1, 1, 1,
        '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10203001', 'まぐろトロ', 'まぐろトロ', 'まぐろトロ', '1', '1234567890', 1000, 900, 500, 1, '00102001', 1, 1, 1,
        '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10203002', 'まぐろ赤身', 'まぐろ赤身', 'まぐろ赤身', '1', '1234567890', 1000, 900, 500, 1, '00102001', 1, 1, 1,
        '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10204002', 'ブラックタイガー', 'ブラックタイガー', 'ブラックタイガー', '1', '1234567890', 1000, 900, 500, 1,
        '00102002', 1, 1, 1, '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('10204003', '大正えび', '大正えび', '大正えび', '1', '1234567890', 1000, 900, 500, 1, '00102002', 1, 1, 1,
        '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('001', 'いちご蒸缶', 'いちご蒸缶', 'いちご蒸缶', '2', '1234567890', 1000, 900, 500, 1, '00102002', 1, 1, 1,
        '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('002', 'いちご蒸缶セット', 'いちご蒸缶セット', 'いちご蒸缶セット', '2', '1234567890', 1000, 900, 500, 1,
        '00102002', 1, 1, 1, '001', 0, '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('X01', '生ウニ', '生ウニ', '生ウニ', '3', '1234567890', 1000, 900, 500, 1, '00102002', 1, 1, 1, '001', 0,
        '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('X02', '大アワビ', '大アワビ', '大アワビ', '3', '1234567890', 1000, 900, 500, 1, '00102002', 1, 1, 1, '001', 0,
        '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."商品マスタ" ("商品コード", "商品正式名", "商品略称", "商品名カナ", "商品区分", "製品型番",
                                 "販売単価", "仕入単価", "売上原価", "税区分", "商品分類コード", "雑区分",
                                 "在庫管理対象区分", "在庫引当区分", "仕入先コード", "仕入先枝番", "作成日時",
                                 "作成者名", "更新日時", "更新者名")
VALUES ('Z01', '缶', '缶', '缶', '4', '1234567890', 1000, 900, 500, 1, '00102002', 1, 1, 1, '001', 0,
        '2022-04-20 00:00:00.000000', 'admin', '2022-04-20 00:00:00.000000', 'admin');
INSERT INTO public."代替商品" ("商品コード", "代替商品コード", "優先順位", "作成日時", "作成者名", "更新日時", "更新者名")

VALUES ('10101001', 'P0000001', 1, '2023-04-24 23:56:06.001000', 'admin', '2023-04-24 23:56:06.001000', 'admin');

INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('002', '001', 2, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');
INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('001', 'X01', 2, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');
INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('001', 'X02', 1, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');
INSERT INTO public."部品表" ("商品コード", "部品コード", "部品数量", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('001', 'Z01', 1, '2023-05-05 16:26:47.267000', 'admin', '2023-05-05 16:26:47.267000', 'admin');

INSERT INTO public."顧客別販売単価" ("商品コード", "取引先コード", "販売単価", "作成日時", "作成者名", "更新日時", "更新者名")
VALUES ('10101001', '001', 800, '2022-04-19 15:00:00.000000', 'admin', '2022-04-19 15:00:00.000000', 'admin');
